[
    {
        "name": "Beetroot Halwa Recipe",
        "time": "35",
        "img": "https://c.ndtvimg.com/2023-11/rt2d5vdg_beetroot-halwa_625x300_10_November_23.jpg",
        "method": "In a wide pan, heat 2 tsp of Ghee.2.Add the skin peel to the pan and sauté for a few minutes.3.Pour in the Milk and cook over low to medium flame for about 15 minutes until the vegetables are thoroughly cooked and soft.4.Once the vegetables are cooked, add Sugar and mava to the pan.5.Continue cooking for an additional 5 minutes until the mixture achieves a thick consistency.6.In a separate pan, sauté the assorted nuts in Ghee until they turn a golden colour.7.Add the remaining Ghee, cardamom pods and seeds, as well as the sautéed nuts, to the main mixture.8.Mix all the ingredient th,oroughly.9.Serve and enjoy the dish while it is warm.",
        "ingredient":["Potato", "Oil", "Flour", "Curd"],
        "description": "This beetroot halwa is a winter delight. If you want, you can easily make this Indian dessert at home this Diwali"
    },
    {
        "name": "Green Moong Cutlet Recipe",
        "time": "30",
        "img": "https://c.ndtvimg.com/2023-07/s1ap2vmo_cutlet_625x300_30_July_23.jpg",
        "method": "1.Soak the green moong dal (mung beans) overnight or for 5-6 hours. Drain the Water and coarsely grind the moong to form a thick paste.2.Wash the poha once under running Water and drain. Keep aside.3.Roast the besan on low flame until it turns light brown and emits aroma.4.In a large bowl, mix the green moong paste, poha, besan, Onion, Chillies, Ginger and coriander.5.Next, add the masala powders mentioned above. Combine all the ingredient we,ll. Taste to adjust Salt.6.Form circular shapes (like patties or tikkis) of the mixture and pan-fry them on both sides on medium flame. Serve the cutlets hot with green chutney and/ or ketchup.",
        "ingredient":["Potato", "Milk", "Sugar", "Ginger"],
        "description": " This delicious cutlet is packed with the goodness of green moong (mung beans), Onions, poha and spices. Healthy and flavourful, this high-protein moong cutlet can be enjoyed even while dieting. You can choose to pan-fry, air-fry or bake it, according to your preference."
    },
    {
        "name": "No-Oil Vegetable Pulao Recipe",
        "time": "25",
        "img": "https://c.ndtvimg.com/2023-01/bcdjpkg_pulao_625x300_31_January_23.jpg",
        "method": "1.First, wash the rice nicely and soak it in Water for around 20-30 minutes. Add half of the Milk to the pressure cooker and allow it to heat.2.Now, add cloves, bay leaves, nutmeg, elaichi, and the cinnamon stick. Allow it to come to a bOil.3.Next, add the chopped carrots, cauliflower, and beans. Then, we need to season it with haldi, Salt, and Sugar. You could also add some cashew nuts at this stage for extra flavour.4.Next, add the soaked rice and saute it in the cooker. Once the Milk dries up, add the remaining Milk and some Water.5.Cover the lid of the cooker and cook the vegetable pulao for one whistle.",
        "ingredient":["Milk", "Sugar", "Flour", "Oil"],
        "description": "Pulao is such a delicious recipe that we can make in few minutes. But today we are bring an amazing recipe of pulao which can be made without Oil and it can be good option for those people who are weight watchers."
    },
    {
        "name": "Masoor Dal Khichdi Recipe",
        "time": "30",
        "img": "https://c.ndtvimg.com/2023-03/m4rcpuv8_gajar-khichdi_625x300_04_March_23.jpg",
        "method": "1.First, rinse the masoor dal and rice separately under running Water until the Water runs clear. Soak them in Water for around 30 mins.2.Now, heat some Ghee in a pressure cooker. Add cumin seeds and let them splutter. Add chopped Onions and saute until they turn golden brown in colour.3.Next, add Ginger-Garlic paste and saute for another minute or so. Add chopped Tomatoes and cook until they turn soft.4.Drain the Water from the soaked dal and rice and add them to the cooker.5.Add haldi, garam masala, and Salt. Mix well. Now, add 4 cups of Water and combine everything together.6.Cover the lid and allow it to cook on high heat for two whistles, then reduce the heat and cook for another 10 mins.",
        "ingredient":["Tomato", "Curd", "Ginger", "Salt"],
        "description": "Dal is staple in indian household, and masoor dal khichdi is comfort food for many of us. Masoor dal recipe is very easy to make and you can pair with roti or rice."
    },
    {
        "name": "Masoor Dal Khichdi Recipe",
        "time": "30",
        "img": "https://c.ndtvimg.com/2023-03/m4rcpuv8_gajar-khichdi_625x300_04_March_23.jpg",
        "method": "1.First, rinse the masoor dal and rice separately under running Water until the Water runs clear. Soak them in Water for around 30 mins.2.Now, heat some Ghee in a pressure cooker. Add cumin seeds and let them splutter. Add chopped Onions and saute until they turn golden brown in colour.3.Next, add Ginger-Garlic paste and saute for another minute or so. Add chopped Tomatoes and cook until they turn soft.4.Drain the Water from the soaked dal and rice and add them to the cooker.5.Add haldi, garam masala, and Salt. Mix well. Now, add 4 cups of Water and combine everything together.6.Cover the lid and allow it to cook on high heat for two whistles, then reduce the heat and cook for another 10 mins.",
        "ingredient":["Tomato", "Curd", "Ginger", "Salt"],
        "description": "Dal is staple in indian household, and masoor dal khichdi is comfort food for many of us. Masoor dal recipe is very easy to make and you can pair with roti or rice."
    },
    {
        "name": "Lauki Besan Cheela Recipe",
        "time": "25",
        "img": "https://c.ndtvimg.com/2023-11/rt2d5vdg_beetroot-halwa_625x300_10_November_23.jpg",
        "method": "1.In a large bowl, mix grated lauki, besan, Salt, Sugar, as well as the chopped veggies and spices mentioned above. Add 1 tbsp Oil and mix.2.Add a little Water and combine all ingredient we,ll to make a thick batter. Note that a runny batter will not hold the heavier ingredient. T,aste to adjust Salt and spice level. Let the batter rest for 5 minutes.3.In a pan/ tawa, heat a little Oil or Ghee to start cooking the cheela. Ladle 1-2 spoons of the batter on top and carefully spread it in a round shape on the tawa.4.Lower the heat to medium flame and allow the cheela to cook. Add more Ghee/ Oil around it as required.5.As the edges turn brown, flip the cheela over and cook until both sides are firm and golden brown. Serve the cheelas hot with chutney of choice.",
        "ingredient":["Milk", "Jeera", "Salt", "Water"],
        "description": "This wholesome besan lauki cheela is packed with irresistible flavours and the goodness of fresh veggies. Grated lauki (bottle gourd) is mixed with besan, spices, Onion and Tomato to make this healthy dish. Enjoy this cheela for a quick and tasty breakfast, lunch or dinner."
    },
    {
        "name": "Sri Lankan Pol Roti Recipe",
        "time": "25",
        "img": "https://c.ndtvimg.com/2023-08/v9qdbrf8_naan_625x300_08_August_23.jpg",
        "method": "1.To make this roti, add grated coconut, green Chillies, Onion, curry leaves, and Salt to a bowl. Mix well and squeeze out the excess Water.2.Now, add maida along with some Water and knead to form a smooth dough. Keep it aside for 5-10 minutes.3.Grease your hands with Oil and divide the dough into equal portions. Take one of the dough balls and flatten it gently using your fingers.4.Heat a tawa set on a low-medium flame and place the flattened dough on it. Cook on each side until it becomes golden brown and crispy. You can even drizzle some Ghee over it.5.Repeat the process with the remaining dough. Sri Lankan pol roti is ready! Serve hot and enjoy!",
        "ingredient":["Onion", "Jeera", "Salt", "Oil"],
        "description": "This is a vegetarian dish, which is very easy to make. Sri Lankan Pol Roti is made with coconut] green chilies and with mils spices."
    },
    {
        "name": "Sri Lankan Pol Roti Recipe",
        "time": "25",
        "img": "https://c.ndtvimg.com/2023-08/v9qdbrf8_naan_625x300_08_August_23.jpg",
        "method": "1.To make this roti, add grated coconut, green Chillies, Onion, curry leaves, and Salt to a bowl. Mix well and squeeze out the excess Water.2.Now, add maida along with some Water and knead to form a smooth dough. Keep it aside for 5-10 minutes.3.Grease your hands with Oil and divide the dough into equal portions. Take one of the dough balls and flatten it gently using your fingers.4.Heat a tawa set on a low-medium flame and place the flattened dough on it. Cook on each side until it becomes golden brown and crispy. You can even drizzle some Ghee over it.5.Repeat the process with the remaining dough. Sri Lankan pol roti is ready! Serve hot and enjoy!",
        "ingredient":["Onion", "Jeera", "Salt", "Oil"],
        "description": "This is a vegetarian dish, which is very easy to make. Sri Lankan Pol Roti is made with coconut] green chilies and with mils spices."
    },
    {
        "name": "Onion Garlic Parantha Recipe",
        "time": "15",
        "img": "https://c.ndtvimg.com/2021-05/7m893iug_parantha_625x300_05_May_21.jpg",
        "method": "1.Heat Oil in a pan. Add Onion, Garlic and cumin powder.2.Saute till the raw smell of Garlic goes away and Onions turn soft, not brown.3.Remove from gas, add green chilli, garam masala and coriander leaves.4.Use this mixture to fill your parathas and enjoy your meal.",
        "ingredient":["Onion", "Flour", "Salt", "Oil", "Water", "Chillies"],
        "description": "Onion Garlic Parantha is a delectable flatbread recipe that can be enjoyed for any meal during the day. With the aromatic flavour of Garlic and crispiness of Onion, this recipe is very easy to make. Prepared with a handful of ingredient such as all purpose Flour, Garlic cloves, coriander leaves, and Ghee. So, what are you waiting for? Make these Onion Garlic parathas and serve them piping hot with mint chutney and pickle."
    },
    {
        "name": "Kalakand",
        "time": "25",
        "img": "https://c.ndtvimg.com/2023-11/r4n6brao_kalakand_625x300_07_November_23.jpg",
        "method": "1.Add Cashews, Almonds, Pistachio and Paneer to the Jar2.Grind the ingredient : Blade speed 12 for 10 seconds & Blade speed 11 for 10 secondsAdd the Milk and Green Cardamom Powder3.Cook for 15 minutes at 95℃ with the blade speed set to Slow Stir. Add Condensed Milk- Mix in all the ingredient at Speed 1 for 5 seconds4.Cook the mixture together for 15 minutes at 95℃ with the blade speed set to Stir",
        "ingredient":["Paneer", "Milk", "Water", "Chillies"],
        "description": "Kalakand is a popular sweet that can be easily made on this festive season. All you need some cashew, almonds, Paneer, Milk and Sugar."
    },
    {
        "name": "Gur Choorma Ladoo",
        "time": "35",
        "img": "https://c.ndtvimg.com/2023-04/qocd5afg_atta-ladoo_625x300_05_April_23.jpg",
        "method": "1.To make ladoo wheat Flour, jaggery, nutmeg powder, Oil and Ghee are required. You have to first take Flour, add Ghee or Oil and knead it into a stiff dough with the help of lukewarm Water.2.After kneading the dough, you will have to rest it for 15 minutes.3.Make muthiyas of dough and heat Oil in a pan. Deep fry all the prepared muthiyas until they become golden crispy.4.After frying, cool them, break them into pieces and then grind them in a mixer. Now take out this mixture in a vessel, melt jaggery in a pan, add it to this mixture and mix well.5.Add cardamom powder and a little ground nutmeg to it. Now heat Ghee and make ladoo by mixing it in this mixture, coat these ladoos with poppy seeds.6.If you want, you can also include dry fruits in it. These ladoos can be prepared and stored for a month.",
        "ingredient":["Flour", "Ghee", "Oil", "Garlic"],
        "description": "Gud Choorma Ladoo is a popular sweet made in Indian homes on many festivals and puja occasions. It tastes very tasty and is perfect to make this 'time on' toccasion of Ganesh Chaturthi."
    },
    {
        "name": "Gulkand Ice Cream",
        "time": "20",
        "img": "https://c.ndtvimg.com/2023-06/ie65asm8_ice-cream_625x300_19_June_23.jpg",
        "method": "Mix all ingredient together and keep in refrigerator for 5-6 hours and when well set, scoop out and serve well garnished.",
        "ingredient":["Water", "Sugar", "Curd", "Chillies"],
        "description": "This is a quick and easy cream recipe which is perfect to make in this summer season."
    },
    {
        "name": "Aloo Palak Paratha",
        "time": "30",
        "img": "https://c.ndtvimg.com/2023-05/icruoj8o_paratha_650x400_21_May_23.jpg",
        "method": "1.Mix all the ingredient of the dough and knead it well. Cover and keep aside for 15 minutes.2.In a kadhai, heat 1 tbsp Ghee/Oil and add the Garlic. After it turns brown, add the chopped Onion and saute for a minute.3.Add chilli powder and spinach (palak). Cover and let it cook for 2 minutes.4.Next, add chaat masala and mashed Potatoes. Mix well for 3-4 minutes. Turn off the stove, add grated cheese (optional) and allow to cool.5.Take the rested dough and knead it again for 2-3 minutes. Break off small balls and flatten them.6.Add around 1 tablespoon of the Potato-spinach filling in the centre of each paratha. Fold the edges over each other to form an envelope/ potli shape and seal them well. Flatten carefully to ensure the stuffing does not come out.7.Heat Ghee on a tawa and roast the parathas on both sides until golden brown. Add extra Ghee around the edges as needed.",
        "ingredient":["Salt", "Ghee", "Chillies", "Garlic"],
        "description": "Give your regular aloo paratha a flavorful and nutritious twist with this unique paratha. Filled with the goodness of Potatoes, spinach, spices and a little cheese, this stuffed paratha might just become your new favourite. Enjoy it for a power-packed breakfast or a wholesome lunch"
    },
    {
        "name": "Banana Kheer",
        "time": "20",
        "img": "https://c.ndtvimg.com/2023-03/sj88bc08_kheer_625x300_21_March_23.jpg",
        "method": "1.BOil the Milk on low-medium flame until it thickens.2.Add kesar, cardamom powder and dry fruits to it. Simmer until the kesar leaves colour.3.Take mashed banana in a bowl and add the Milk to it.4.Garnish with sliced banana and serve.",
        "ingredient":["Milk", "Onlion", "Flour", "Water"],
        "description": "This banana kheer is a delicious recipe, which is not fulfill your dessert cravings, you can also have it in your breakfast."
    }
]